src/Documents/СчетКонтрагента/СчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетКонтрагента</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправкиГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиГруза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОриентировачнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитнаяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СтатусыДоставки/СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </resources>
  <attributes>
    <name>ОриентеровачнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыДоставкиСвернуто/СтатусыДоставкиСвернуто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставкиСвернуто</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыЗаявокВТК/СтатусыЗаявокВТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявокВТК</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийСчетКонтрагента/ВидыОперацийСчетКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСчетКонтрагента</name>
  <enumValues>
    <name>СТранспортнойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>СЭкспедиторскойКомпанией</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыОтправкиГруза/СтатусыОтправкиГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиГруза</name>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>СформирванаЗаявкаВТК</name>
  </enumValues>
  <enumValues>
    <name>ВыехалСТочки</name>
  </enumValues>
  <enumValues>
    <name>ВТранспортнойКомпании</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленСчетЭК</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПолучения</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаВТранспортнуюКомпанию/ЗаявкаВТранспортнуюКомпанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаВТранспортнуюКомпанию</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СчетКонтрагента/ObjectModule.bsl
Процедура ДвиженияСтатусыДоставки(Отказ, Режим)
	Движения.СтатусыДоставки.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Заказы Цикл
		
		Движение = Движения.СтатусыДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Груз = ТекСтрокаПокупки.Груз;
		Если ВидОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.ВТранспортнойКомпании;
		Иначе
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.ДобавленСчетЭК;
		КонецЕсли;
		Движение.ОриентеровачнаяДатаДоставки=ОриентировачнаяДатаДоставки;
	КонецЦикла;
КонецПроцедуры


Процедура ДвиженияСтатусыДоставкиСвернуто(Отказ, Режим)
	Движения.СтатусыДоставкиСвернуто.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетКонтрагентаЗаказы.Заявка КАК ЗаявкаВТК,
		|	ВЫБОР
		|		КОГДА СчетКонтрагентаЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ВТранспортнойКомпании)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ДобавленСчетЭК)
		|	КОНЕЦ КАК Статус,
		|	СчетКонтрагентаЗаказы.Ссылка.Дата КАК Период,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест КАК КоличествоМест,
		|	СУММА(СчетКонтрагентаЗаказы.Груз.Количество) КАК Количество,
		|	СУММА(1) КАК КоличествоГС
		|ИЗ
		|	Документ.СчетКонтрагента.Заказы КАК СчетКонтрагентаЗаказы
		|ГДЕ
		|	СчетКонтрагентаЗаказы.Ссылка = &Ссылка
		|	И СчетКонтрагентаЗаказы.Заявка.СвояТочка = &СвояТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаЗаказы.Заявка,
		|	ВЫБОР
		|		КОГДА СчетКонтрагентаЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ВТранспортнойКомпании)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ДобавленСчетЭК)
		|	КОНЕЦ,
		|	СчетКонтрагентаЗаказы.Ссылка.Дата,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетКонтрагентаЗаказы.Заявка,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ОжидаетДоставки),
		|	СчетКонтрагентаЗаказы.Ссылка.ОриентировачнаяДатаДоставки,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест,
		|	СУММА(СчетКонтрагентаЗаказы.Груз.Количество),
		|	СУММА(1)
		|ИЗ
		|	Документ.СчетКонтрагента.Заказы КАК СчетКонтрагентаЗаказы
		|ГДЕ
		|	СчетКонтрагентаЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией)
		|	И СчетКонтрагентаЗаказы.Ссылка = &Ссылка
		|	И СчетКонтрагентаЗаказы.Заявка.СвояТочка = &СвояТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаЗаказы.Заявка,
		|	СчетКонтрагентаЗаказы.Ссылка.ОриентировачнаяДатаДоставки,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетКонтрагентаЗаказы.Заявка,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиГруза.ОжидаетПолучения),
		|	СчетКонтрагентаЗаказы.Ссылка.ОриентировачнаяДатаДоставки,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест,
		|	СУММА(СчетКонтрагентаЗаказы.Груз.Количество),
		|	СУММА(1)
		|ИЗ
		|	Документ.СчетКонтрагента.Заказы КАК СчетКонтрагентаЗаказы
		|ГДЕ
		|	СчетКонтрагентаЗаказы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией)
		|	И СчетКонтрагентаЗаказы.Ссылка = &Ссылка
		|	И СчетКонтрагентаЗаказы.Заявка.СвояТочка <> &СвояТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетКонтрагентаЗаказы.Заявка,
		|	СчетКонтрагентаЗаказы.Ссылка.ОриентировачнаяДатаДоставки,
		|	СчетКонтрагентаЗаказы.Заявка.КоличествоМест";
	Запрос.Параметры.Вставить("Ссылка",Ссылка);
	Запрос.Параметры.Вставить("СвояТочка",Константы.СвояТочка.Получить());

	РезультатЗапроса = Запрос.Выполнить();
	Движения.СтатусыДоставкиСвернуто.Загрузить(РезультатЗапроса.Выгрузить());

	
	
	
КонецПроцедуры


Процедура ДвиженияСтатусыЗаявокВТК(Отказ, Режим)
	Движения.СтатусыЗаявокВТК.Записывать = Истина;
	Для каждого стр Из ЗаявкиВТК Цикл
		Если не ЗначениеЗаполнено(стр.Заявка) Тогда продолжить; КонецЕсли;
		Движение = Движения.СтатусыЗаявокВТК.Добавить();
		Движение.Период = Дата;
		Движение.Заявка= стр.Заявка;
		Если ВидОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.ВТранспортнойКомпании;
		Иначе
			Движение.Статус = Перечисления.СтатусыОтправкиГруза.ДобавленСчетЭК;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	Если ВидОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
		ДвиженияСтатусыДоставки(Отказ, РежимПроведения);
		ДвиженияСтатусыДоставкиСвернуто(Отказ, РежимПроведения);
		ДвиженияСтатусыЗаявокВТК(Отказ, РежимПроведения);
		ДвиженияВзаиморасчетыСКонтрагентами(Отказ, РежимПроведения);
//	КонецЕсли	
КонецПроцедуры


Процедура ЗаполнитьВесОбъемПоГрузу()  экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоробкиОрганизаторы.Организатор,
		|	СУММА(КоробкиОрганизаторы.Вес) КАК Вес,
		|	СУММА(КоробкиОрганизаторы.Объем) КАК Объем,
		|	СУММА(КоробкиОрганизаторы.Количество) КАК Количество
		|ИЗ
		|	Справочник.Коробки.Организаторы КАК КоробкиОрганизаторы
		|ГДЕ
		|	КоробкиОрганизаторы.Ссылка В(&Коробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	КоробкиОрганизаторы.Организатор";
		
		
	
	коробки=новый СписокЗначений;
	Для каждого стр из Заказы Цикл
		коробки.Добавить(стр.Груз);
	КонецЦикла;	
	
	
	Запрос.Параметры.Вставить("Коробки",коробки);
		РезультатЗапроса = Запрос.Выполнить();
	
	Организаторы.Загрузить(РезультатЗапроса.Выгрузить());
	

	Вес=Организаторы.Итог("Вес");
	массИтог= аСПНаСервере.РаспределитьПропорционально(100,Организаторы.ВыгрузитьКолонку("Вес"));
	Если   массИтог<>неопределено Тогда  
		Организаторы.ЗагрузитьКолонку(массИтог,"ВесПроцент");
	КонецЕсли;	
	Объем=Организаторы.Итог("Объем");
	массИтог= аСПНаСервере.РаспределитьПропорционально(100,Организаторы.ВыгрузитьКолонку("Объем"));
	Если   массИтог<>неопределено Тогда  
		Организаторы.ЗагрузитьКолонку(массИтог,"ОбъемПроцент");
	КонецЕсли;
	
	Количество=Организаторы.Итог("Количество");
	массИтог= аСПНаСервере.РаспределитьПропорционально(100,Организаторы.ВыгрузитьКолонку("Количество"));
	Если   массИтог<>неопределено Тогда  
		Организаторы.ЗагрузитьКолонку(массИтог,"КоличествоПроцент");
	КонецЕсли;
	
	ЗаполнитьОргов();
КонецПроцедуры	



Процедура ЗаполнитьОргов() Экспорт
	СписокКодов=новый СписокЗначений;
	Для каждого стр из Заказы Цикл
		
		СписокКодов.Добавить(стр.Груз);
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоробкиСостав.Покупка.Организатор КАК Организатор
		|ИЗ
		|	Справочник.Коробки.Состав КАК КоробкиСостав
		|ГДЕ
		|	КоробкиСостав.Ссылка В
		|			(&СписокКодов)";
	
	Запрос.УстановитьПараметр("СписокКодов", СписокКодов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Организаторы.НайтиСтроки(новый структура("Организатор", ВыборкаДетальныеЗаписи.Организатор)).Количество()=0 Тогда
			новаяСтрока=Организаторы.Добавить();	
			новаяСтрока.Организатор=ВыборкаДетальныеЗаписи.Организатор;
		КонецЕсли;	
	КонецЦикла;
	УстановитьПроценты();
КонецПроцедуры	

Процедура УстановитьПроценты() Экспорт
	массивВесПроцент=Организаторы.ВыгрузитьКолонку("ВесПроцент");
	Если Организаторы.Итог("ВесПроцент")=0 и массивВесПроцент.количество()>0 Тогда
		Для инд=0 по массивВесПроцент.количество()-1 цикл
			массивВесПроцент[инд]=1;
		КонецЦикла;	
		массИтог= аСПНаСервере.РаспределитьПропорционально(100,массивВесПроцент);
		Организаторы.ЗагрузитьКолонку(массИтог,"ВесПроцент");
	КонецЕсли;
	массИтог= аСПНаСервере.РаспределитьПропорционально(Вес,Организаторы.ВыгрузитьКолонку("ВесПроцент"));
	Если   массИтог<>неопределено Тогда  
		Организаторы.ЗагрузитьКолонку(массИтог,"Вес");
	КонецЕсли;
	
	
	массивОбъемПроцент=Организаторы.ВыгрузитьКолонку("ОбъемПроцент");
	Если Организаторы.Итог("ОбъемПроцент")=0 и массивОбъемПроцент.количество()>0 Тогда
		Для инд=0 по массивОбъемПроцент.количество()-1 цикл
			массивОбъемПроцент[инд]=1;
		КонецЦикла;	
		массИтог= аСПНаСервере.РаспределитьПропорционально(100,массивОбъемПроцент);
		Организаторы.ЗагрузитьКолонку(массИтог,"ОбъемПроцент");
	КонецЕсли;	
	массИтог= аСПНаСервере.РаспределитьПропорционально(Объем,Организаторы.ВыгрузитьКолонку("ОбъемПроцент"));
	Если   массИтог<>неопределено Тогда  
		Организаторы.ЗагрузитьКолонку(массИтог,"Объем");
	КонецЕсли;
	
	массивКоличество=Организаторы.ВыгрузитьКолонку("Количество");
	Если Организаторы.Итог("КоличествоПроцент")=0 и массивКоличество.количество()>0 Тогда
		массИтог= аСПНаСервере.РаспределитьПропорционально(100,массивКоличество);
		Если   массИтог<>неопределено Тогда  
			Организаторы.ЗагрузитьКолонку(массИтог,"КоличествоПроцент");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры




Процедура ДвиженияВзаиморасчетыСКонтрагентами(Отказ, Режим)
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;

	Если ВидОперации=Перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда
		Для Каждого ТекСтрокаОрганизаторы Из Организаторы Цикл
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = ТекСтрокаОрганизаторы.Организатор;
			Движение.Сумма = ТекСтрокаОрганизаторы.Сумма;
		КонецЦикла;
	Иначе	
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = ТранзитнаяТочка;
			Движение.Сумма = Сумма;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации=перечисления.ВидыОперацийСчетКонтрагента.СТранспортнойКомпанией Тогда	
		НеПроверять="ТранзитнаяТочка";	
		инд=ПроверяемыеРеквизиты.Найти(НеПроверять);
		Если инд<>Неопределено Тогда ПроверяемыеРеквизиты.Удалить(инд); КонецЕсли;
		
		Если Организаторы.Итог("Сумма")<> Сумма Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не правильно распределена сумма счета!",,,,Отказ);
		КонецЕсли;
	Иначе	
		НеПроверять="ОриентировачнаяДатаДоставки";	
		инд=ПроверяемыеРеквизиты.Найти(НеПроверять);
		Если инд<>Неопределено Тогда ПроверяемыеРеквизиты.Удалить(инд); КонецЕсли;
	КонецЕсли;
	СПКонтрольДоставкиГрузов.ПроверитьУникальностьСтатусаДляГруза(ЭтотОбъект,Отказ);
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если не ЗначениеЗаполнено(СвояТочка) Тогда
		СвояТочка=константы.СвояТочка.Получить();
  	КонецЕсли;
		
	Если СвояТочка=константы.СвояТочка.Получить() и РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		СПКонтрольДоставкиГрузов.ЗаполнитьЗаявкиПоКоробкам(ЭтотОбъект,"Заказы","Груз");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетКонтрагентаЗаявкиВТК.Заявка,
		|	СчетКонтрагентаЗаявкиВТК.Ссылка
		|ИЗ
		|	Документ.СчетКонтрагента.ЗаявкиВТК КАК СчетКонтрагентаЗаявкиВТК
		|ГДЕ
		|	СчетКонтрагентаЗаявкиВТК.Ссылка <> &Ссылка
		|	И СчетКонтрагентаЗаявкиВТК.Заявка В(&СписокЗаявок)
		|	И СчетКонтрагентаЗаявкиВТК.Ссылка.Проведен
		|	И СчетКонтрагентаЗаявкиВТК.Ссылка.ВидОперации = &ВидОперации 
		|	И СчетКонтрагентаЗаявкиВТК.Заявка <> ЗНАЧЕНИЕ(Документ.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка)";
		Запрос.УстановитьПараметр("СписокЗаявок", ЗаявкиВТК.ВыгрузитьКолонку("Заявка"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка "+ВыборкаДетальныеЗаписи.Заявка+" уже отправлена доокументом "+ВыборкаДетальныеЗаписи.ссылка,,,,Отказ); 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура ЗаполнитьПоСпискуЗаявок(СписокЗаявок) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Груз,
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка КАК Заявка
		|ИЗ
		|	Документ.ЗаявкаВТранспортнуюКомпанию.Заказы КАК ЗаявкаВТранспортнуюКомпаниюЗаказы
		|ГДЕ
		|	ЗаявкаВТранспортнуюКомпаниюЗаказы.Ссылка В(&СписокЗаявок)";
	
	Запрос.УстановитьПараметр("СписокЗаявок", СписокЗаявок);

	РезультатЗапроса = Запрос.Выполнить();
	тз=РезультатЗапроса.Выгрузить();
	Заказы.Загрузить(тз);	
	тз.Свернуть("Заявка");
	ЗаявкиВТК.Загрузить(ТЗ);
КонецПроцедуры
